```
data.aws_iam_policy.lambda_basic: Reading...
data.aws_iam_policy_document.eventbridge_assume: Reading...
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/sentinel-prod-lambda-function-use1]
data.aws_iam_policy_document.lambda_assume: Reading...
aws_s3_bucket_versioning.backend: Refreshing state... [id=sentinel-prod-s3-bucket-use1]
aws_scheduler_schedule_group.schedule_group: Refreshing state... [id=sentinel-prod-eventbridge-group-use1]
aws_s3_bucket.backend: Refreshing state... [id=sentinel-prod-s3-bucket-use1]
data.aws_iam_policy_document.eventbridge_assume: Read complete after 0s [id=52247394]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_iam_role.lambda: Refreshing state... [id=sentinel-prod-iam-role-lambda-use1]
aws_iam_role.eventbridge: Refreshing state... [id=sentinel-prod-iam-role-eventbridge-use1]
data.aws_iam_policy.lambda_basic: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.lambda_logging_policy_role_attachment: Refreshing state... [id=sentinel-prod-iam-role-lambda-use1-20250611231657841600000001]
aws_lambda_function.lambda: Refreshing state... [id=sentinel-prod-lambda-function-use1]
aws_iam_policy.eventbridge: Refreshing state... [id=arn:aws:iam::469264374601:policy/sentinel-prod-iam-policy-eventbridge-use1]
aws_scheduler_schedule.schedule: Refreshing state... [id=sentinel-prod-eventbridge-group-use1/sentinel-prod-eventbridge-schedule-use1]
aws_iam_role_policy_attachment.eventbridge: Refreshing state... [id=sentinel-prod-iam-role-eventbridge-use1-20250609235841095800000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eventbridge will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eventbridge" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:us-east-1:469264374601:function:sentinel-prod-lambda-function-use1",
            ]
        }
    }

  # aws_iam_policy.eventbridge will be updated in-place
  ~ resource "aws_iam_policy" "eventbridge" {
        id               = "arn:aws:iam::469264374601:policy/sentinel-prod-iam-policy-eventbridge-use1"
        name             = "sentinel-prod-iam-policy-eventbridge-use1"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-east-1:469264374601:function:sentinel-prod-lambda-function-use1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_secrets_policy will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id          = (known after apply)
      + name        = "lambda-secrets-access-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sentinel-prod-iam-role-lambda-use1"
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = "./lambda_fb2e2b5523fe65c6abbed95f9341b528370c7aff.zip" -> "./lambda_a0152ff2840c164fe4e858c2358e2346a087112d.zip"
        id                             = "sentinel-prod-lambda-function-use1"
      ~ last_modified                  = "2025-07-23T22:39:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "6YLFoPOakmLPsojaSAAXWwYYSXsWIofrfNcy0oklBdg=" -> "rf7g4cNnQV0Owtim03/Rb53ulCgyVGd8kRY9vQk9dxU="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "Secrets used by Sentinel lambda function"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "sentinel-prod-secrets-use1"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = {
          + "Environment" = "production"
          + "Project"     = "sentinel"
          + "Region"      = "us-east-1"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secret_version" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```